Revit 2027 API
PlanCircuit.GetPointInside Method
Returns a point inside the circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV GetPointInside()
Public Function GetPointInside As UV
public:
UV^ GetPointInside()
member GetPointInside : unit -> UV
Return Value
UV
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when a valid UV point couldn't be obtained.
See Also
Reference
PlanCircuit Class
Autodesk.Revit.DB Namespace